////////////////// CONCAT ////////////////////////////////////////
// Метод Concat - конкатенує стрічку
// let str = 'Con'
// let str2 = 'cat'
// let conCat = str.concat(str2)
// console.log(conCat);


//////////////// toUpperCase ////////////////////////////////////
//Метод toUpperCase  - повертає стрічку в верхньому регістрі
// let str = 'let me do it!'
// console.log(str.toUpperCase())


//////////////// toLowerCase ////////////////////////////////////
//Метод toLowerCase  - повертає стрічку в нижньому регістрі
// let str = 'LET ME DO IT!'
// console.log(str.toLowerCase())


/////////////// startsWith //////////////////////////////////////
// Метод startsWith - дає змогу визначати, чи починається рядок із зазначених у дужках символів.
// let str = 'LET ME DO IT!'
// console.log(str.startsWith('L'));


/////////////// endsWith //////////////////////////////////////
// Метод endsWith - дає змогу визначати, чи закінчується рядок із зазначених у дужках символів.

 // let str = 'LET ME DO IT!'
 // console.log(str.endsWith('!'));

//////////////// substring //////////////////////////////////////
// Метод substring - дає змогу обрізати стрічку.
// let str = '0 1 2 3 4 5 6 7 8 9'
// console.log(str.substring(0, 8));

//////////////// indexOf //////////////////////////////////////
// Метод indexOf - дає змогу дізнатися індех символа.
// let str = '0 1 2 3 4 5 6 7 8 9'
// console.log(str.indexOf('8'));

//////////////// lastIndexOf //////////////////////////////////////
// Метод lastIndexOf - дає змогу дізнатися індех символа з права на ліво.
// let str = '0 1 2 3 4 5 6 7 8 9'
// console.log(str.lastIndexOf('8'));

//////////////// charAt //////////////////////////////////////
// Метод lastIndexOf - дає змогу дізнатися символ по індексу.
// let str = '0 1 2 3 4 5 6 7 8 9'
// console.log(str.charAt(8));

//////////////// replace //////////////////////////////////////
// Метод replace - дає змогу змінити символ  на вказаний символ.
// let str = '0 1 2 3 4 5 6 7 8 9'
// console.log(str.replace('5', '55'));

//////////////// replaceAll //////////////////////////////////////
// Метод replace - дає змогу змінити всі подібні символи  на вказаний символ.
// let str = '5, 0 1 2 3 4 5 6 7 8 5, 9'
// // console.log(str.replaceAll('5', '55'));

//////////////// split //////////////////////////////////////
// Метод replace - дає змогу розділити на частини по вказаному символу.
// let str = '5 0 1 2 3 4, 5 6 7 8 5 9'
// console.log(str.split( ','));